itzandroidtab/klib-svd/tmpm373.svd
<?xml version="1.0" encoding="utf-8"?>
<device schemaVersion="1.0"
	xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_0.xsd" >
	<name>tmpm373</name>
	<version>0.1</version>
	<description>TOSHIBA Cortex-M3 MCU</description>
    <cpu>
        <name>CM3</name>
        <revision>r2p0</revision>
        <endian>little</endian>
        <mpuPresent>false</mpuPresent>
        <fpuPresent>false</fpuPresent>
        <nvicPrioBits>4</nvicPrioBits>
        <vendorSystickConfig>false</vendorSystickConfig>
    </cpu>
	<addressUnitBits>8</addressUnitBits>
	<width>32</width>
	<peripherals>
		<peripheral>
			<name>PA</name>
			<description>General Purpose Input_Output Port (PA)</description>
			<baseAddress>0x40000000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x10</size>
				<usage>registers</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x10</offset>
				<size>0x18</size>
				<usage>reserved</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x28</offset>
				<size>0xc</size>
				<usage>registers</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x34</offset>
				<size>0x4</size>
				<usage>reserved</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x38</offset>
				<size>0x4</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>DATA</name>
					<description>PA Register</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PA2</name>
							<description>PA2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PA4</name>
							<description>PA4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PA5</name>
							<description>PA5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PA6</name>
							<description>PA6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<description>PA Control Register</description>
					<addressOffset>0x4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PA2C</name>
							<description>PA2C</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PA4C</name>
							<description>PA4C</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PA5C</name>
							<description>PA5C</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PA6C</name>
							<description>PA6C</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FR1</name>
					<description>PA Function Register 1</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PA2F1</name>
							<description>PA2F1</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PA4F1</name>
							<description>PA4F1</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PA5F1</name>
							<description>PA5F1</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PA6F1</name>
							<description>PA6F1</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FR2</name>
					<description>PA Function Register 2</description>
					<addressOffset>0xC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PA2F2</name>
							<description>PA2F2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PA4F2</name>
							<description>PA4F2</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PA5F2</name>
							<description>PA5F2</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PA6F2</name>
							<description>PA6F2</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OD</name>
					<description>PA Open Drain Control Register</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PA2OD</name>
							<description>PA2OD</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PA4OD</name>
							<description>PA4OD</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PA5OD</name>
							<description>PA5OD</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PA6OD</name>
							<description>PA6OD</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PUP</name>
					<description>PA Pull-Up Control Register</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PA2UP</name>
							<description>PA2UP</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PA4UP</name>
							<description>PA4UP</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PA5UP</name>
							<description>PA5UP</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PA6UP</name>
							<description>PA6UP</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PDN</name>
					<description>PA Pull-Down Control Register</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PA2DN</name>
							<description>PA2DN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PA4DN</name>
							<description>PA4DN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PA5DN</name>
							<description>PA5DN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PA6DN</name>
							<description>PA6DN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IE</name>
					<description>PA Input Enable Control Register</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PA2IE</name>
							<description>PA2IE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PA4IE</name>
							<description>PA4IE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PA5IE</name>
							<description>PA5IE</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PA6IE</name>
							<description>PA6IE</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
