itzandroidtab/klib-svd/tmpm373.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>PI</name>
			<description>General Purpose Input_Output Port (PI)</description>
			<baseAddress>0x40000200</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x8</size>
				<usage>registers</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x8</offset>
				<size>0x20</size>
				<usage>reserved</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x28</offset>
				<size>0xc</size>
				<usage>registers</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x34</offset>
				<size>0x4</size>
				<usage>reserved</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x38</offset>
				<size>0x4</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>DATA</name>
					<description>PI Register</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PI3</name>
							<description>PI3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<description>PI Control Register</description>
					<addressOffset>0x4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PI3C</name>
							<description>PI3C</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OD</name>
					<description>PI Open Drain Control Register</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PI3OD</name>
							<description>PI3OD</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PUP</name>
					<description>PI Pull-Up Control Register</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PI3UP</name>
							<description>PI3UP</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PDN</name>
					<description>PI Pull-Down Control Register</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PI3DN</name>
							<description>PI3DN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IE</name>
					<description>PI Input Enable Control Register</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PI3IE</name>
							<description>PI3IE</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>PJ</name>
			<description>General Purpose Input_Output Port (PJ)</description>
			<baseAddress>0x40000240</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xc</size>
				<usage>registers</usage>
			</addressBlock>
			<addressBlock>
				<offset>0xc</offset>
				<size>0x1c</size>
				<usage>reserved</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x28</offset>
				<size>0xc</size>
				<usage>registers</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x34</offset>
				<size>0x4</size>
				<usage>reserved</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x38</offset>
				<size>0x4</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>DATA</name>
					<description>PJ Register</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PJ0</name>
							<description>PJ0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PJ5</name>
							<description>PJ5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PJ6</name>
							<description>PJ6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PJ7</name>
							<description>PJ7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<description>PJ Control Register</description>
					<addressOffset>0x4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PJ0C</name>
							<description>PJ0C</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PJ5C</name>
							<description>PJ5C</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PJ6C</name>
							<description>PJ6C</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PJ7C</name>
							<description>PJ7C</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FR1</name>
					<description>PJ Function Register 1</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PJ6F1</name>
							<description>PJ6F1</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PJ7F1</name>
							<description>PJ7F1</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OD</name>
					<description>PJ Open Drain Control Register</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PJ0OD</name>
							<description>PJ0OD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PJ5OD</name>
							<description>PJ5OD</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PJ6OD</name>
							<description>PJ6OD</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PJ7OD</name>
							<description>PJ7OD</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PUP</name>
					<description>PJ Pull-Up Control Register</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PJ0UP</name>
							<description>PJ0UP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PJ5UP</name>
							<description>PJ5UP</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PJ6UP</name>
							<description>PJ6UP</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PJ7UP</name>
							<description>PJ7UP</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PDN</name>
					<description>PJ Pull-Down Control Register</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PJ0DN</name>
							<description>PJ0DN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PJ5DN</name>
							<description>PJ5DN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PJ6DN</name>
							<description>PJ6DN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PJ7DN</name>
							<description>PJ7DN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IE</name>
					<description>PJ Input Enable Control Register</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PJ0IE</name>
							<description>PJ0IE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PJ5IE</name>
							<description>PJ5IE</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PJ6IE</name>
							<description>PJ6IE</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PJ7IE</name>
							<description>PJ7IE</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
