itzandroidtab/klib-svd/tmpm373.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>PK</name>
			<description>General Purpose Input_Output Port (PK)</description>
			<baseAddress>0x40000280</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xc</size>
				<usage>registers</usage>
			</addressBlock>
			<addressBlock>
				<offset>0xc</offset>
				<size>0x1c</size>
				<usage>reserved</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x28</offset>
				<size>0xc</size>
				<usage>registers</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x34</offset>
				<size>0x4</size>
				<usage>reserved</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x38</offset>
				<size>0x4</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>DATA</name>
					<description>PK Register</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PK0</name>
							<description>PK0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PK1</name>
							<description>PK1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<description>PK Control Register</description>
					<addressOffset>0x4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PK0C</name>
							<description>PK0C</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PK1C</name>
							<description>PK1C</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FR1</name>
					<description>PK Function Register 1</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PK0F1</name>
							<description>PK0F1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PK1F1</name>
							<description>PK1F1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OD</name>
					<description>PK Open Drain Control Register</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PK0OD</name>
							<description>PK0OD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PK1OD</name>
							<description>PK1OD</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PUP</name>
					<description>PK Pull-Up Control Register</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PK0UP</name>
							<description>PK0UP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PK1UP</name>
							<description>PK1UP</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PDN</name>
					<description>PK Pull-Down Control Register</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PK0DN</name>
							<description>PK0DN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PK1DN</name>
							<description>PK1DN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IE</name>
					<description>PK Input Enable Control Register</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PK0IE</name>
							<description>PK0IE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PK1IE</name>
							<description>PK1IE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>PM</name>
			<description>General Purpose Input_Output Port (PM)</description>
			<baseAddress>0x40000300</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x8</size>
				<usage>registers</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x8</offset>
				<size>0x20</size>
				<usage>reserved</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x28</offset>
				<size>0xc</size>
				<usage>registers</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x34</offset>
				<size>0x4</size>
				<usage>reserved</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x38</offset>
				<size>0x4</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>DATA</name>
					<description>PM Register</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PM0</name>
							<description>PM0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PM1</name>
							<description>PM1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<description>PM Control Register</description>
					<addressOffset>0x4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PM0C</name>
							<description>PM0C</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PM1C</name>
							<description>PM1C</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OD</name>
					<description>PM Open Drain Control Register</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PM0OD</name>
							<description>PM0OD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PM1OD</name>
							<description>PM1OD</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PUP</name>
					<description>PM Pull-Up Control Register</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PM0UP</name>
							<description>PM0UP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PM1UP</name>
							<description>PM1UP</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PDN</name>
					<description>PM Pull-Down Control Register</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PM0DN</name>
							<description>PM0DN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PM1DN</name>
							<description>PM1DN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IE</name>
					<description>PM Input Enable Control Register</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PM0IE</name>
							<description>PM0IE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PM1IE</name>
							<description>PM1IE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
