itzandroidtab/klib-svd/tmpm373.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>TB0</name>
			<description>16-bit Timer_Event Counter (TB)</description>
			<baseAddress>0x40010000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x30</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>EN</name>
					<description>TB Enable Register</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TBHALT</name>
							<description>TBHALT</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TBEN</name>
							<description>TBEN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RUN</name>
					<description>TB RUN Register</description>
					<addressOffset>0x4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TBRUN</name>
							<description>TBRUN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TBPRUN</name>
							<description>TBPRUN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<description>TB Control Register</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CSSEL</name>
							<description>CSSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRGSEL</name>
							<description>TRGSEL</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>I2TB</name>
							<description>I2TB</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TBWBF</name>
							<description>TBWBF</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MOD</name>
					<description>TB Mode Register</description>
					<addressOffset>0xC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000020</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TBCLK</name>
							<description>TBCLK</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TBCLE</name>
							<description>TBCLE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TBCPM</name>
							<description>TBCPM</description>
							<bitOffset>3</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TBCP</name>
							<description>TBCP</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TBRSWR</name>
							<description>TBRSWR</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FFCR</name>
					<description>TB Flip-Flop Control Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x000000c3</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TBFF0C</name>
							<description>TBFF0C</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TBE0T1</name>
							<description>TBE0T1</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TBE1T1</name>
							<description>TBE1T1</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TBC0T1</name>
							<description>TBC0T1</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TBC1T1</name>
							<description>TBC1T1</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ST</name>
					<description>TB Status Register</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>INTTB0</name>
							<description>INTTB0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>INTTB1</name>
							<description>INTTB1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>INTTBOF</name>
							<description>INTTBOF</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IM</name>
					<description>TB Interrupt Mask Register</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TBIM0</name>
							<description>TBIM0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TBIM1</name>
							<description>TBIM1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TBIMOF</name>
							<description>TBIMOF</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UC</name>
					<description>TB Read Capture Register</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>UC</name>
							<description>UC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RG0</name>
					<description>TB RG0 Timer Register</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TBRG0</name>
							<description>TBRG0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RG1</name>
					<description>TB RG1 Timer Register</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TBRG1</name>
							<description>TBRG1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CP0</name>
					<description>TB CP0 Capture Register</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TBCP0</name>
							<description>TBCP0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CP1</name>
					<description>TB CP1 Capture Register</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TBCP1</name>
							<description>TBCP1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
