itzandroidtab/klib-svd/tmpm373.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="TB0">
			<name>TB1</name>
			<baseAddress>0x40010040</baseAddress>
		</peripheral>
		<peripheral derivedFrom="TB0">
			<name>TB2</name>
			<baseAddress>0x40010080</baseAddress>
		</peripheral>
		<peripheral derivedFrom="TB0">
			<name>TB3</name>
			<baseAddress>0x400100C0</baseAddress>
		</peripheral>
		<peripheral derivedFrom="TB0">
			<name>TB4</name>
			<baseAddress>0x40010100</baseAddress>
		</peripheral>
		<peripheral derivedFrom="TB0">
			<name>TB5</name>
			<baseAddress>0x40010140</baseAddress>
		</peripheral>
		<peripheral derivedFrom="TB0">
			<name>TB6</name>
			<baseAddress>0x40010180</baseAddress>
		</peripheral>
		<peripheral derivedFrom="TB0">
			<name>TB7</name>
			<baseAddress>0x400101C0</baseAddress>
		</peripheral>
		<peripheral>
			<name>EN</name>
			<description>Encoder Input (ENC)</description>
			<baseAddress>0x40010500</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x10</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>TNCR</name>
					<description>Encoder Input Control Register</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ENDEV</name>
							<description>ENDEV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INTEN</name>
							<description>INTEN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NR</name>
							<description>NR</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENRUN</name>
							<description>ENRUN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ZEN</name>
							<description>ZEN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CMPEN</name>
							<description>CMPEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ZESEL</name>
							<description>ZESEL</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENCLR</name>
							<description>ENCLR</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SFTCAP</name>
							<description>SFTCAP</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ZDET</name>
							<description>ZDET</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>UD</name>
							<description>UD</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>REVERR</name>
							<description>REVERR</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CMP</name>
							<description>CMP</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>P3EN</name>
							<description>P3EN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE</name>
							<description>MODE</description>
							<bitOffset>17</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RELOAD</name>
					<description>Encoder Counter Reload Register</description>
					<addressOffset>0x4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RELOAD</name>
							<description>RELOAD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>INT</name>
					<description>Encoder Compare Register</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>INT</name>
							<description>INT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CNT</name>
					<description>Encoder Counter Register</description>
					<addressOffset>0xC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>CNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>SC0</name>
			<description>Serial Channel (SC)</description>
			<baseAddress>0x40020080</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x34</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>EN</name>
					<description>SC Enable Register</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SIOE</name>
							<description>SIOE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF</name>
					<description>SC Buffer Register</description>
					<addressOffset>0x4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TR_RB</name>
							<description>TR_RB</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<description>SC Control Register</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IOC</name>
							<description>IOC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SCLKS</name>
							<description>SCLKS</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FERR</name>
							<description>FERR</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PERR</name>
							<description>PERR</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OERR</name>
							<description>OERR</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PE</name>
							<description>PE</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EVEN</name>
							<description>EVEN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RB8</name>
							<description>RB8</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MOD0</name>
					<description>SC Mode Control Register 0</description>
					<addressOffset>0xC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SC</name>
							<description>SC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SM</name>
							<description>SM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WU</name>
							<description>WU</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RXE</name>
							<description>RXE</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CTSE</name>
							<description>CTSE</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TB8</name>
							<description>TB8</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BRCR</name>
					<description>SC Baud Rate Generator Control Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>BR0S</name>
							<description>BR0S</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BR0CK</name>
							<description>BR0CK</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BRADDE</name>
							<description>BRADDE</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BRADD</name>
					<description>SC Baud Rate Generator Control Register 2</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>BR0K</name>
							<description>BR0K</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MOD1</name>
					<description>SC Mode Control Register 1</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SINT</name>
							<description>SINT</description>
							<bitOffset>1</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXE</name>
							<description>TXE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FDPX</name>
							<description>FDPX</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>I2S0</name>
							<description>I2S0</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MOD2</name>
					<description>SC Mode Control Register 2</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000080</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SWRST</name>
							<description>SWRST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WBUF</name>
							<description>WBUF</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRCHG</name>
							<description>DRCHG</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SBLEN</name>
							<description>SBLEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXRUN</name>
							<description>TXRUN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RBFLL</name>
							<description>RBFLL</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TBEMP</name>
							<description>TBEMP</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RFC</name>
					<description>SC RX FIFO Configuration Register</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RIL</name>
							<description>RIL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RFIS</name>
							<description>RFIS</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RFCS</name>
							<description>RFCS</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TFC</name>
					<description>SC TX FIFO Configuration Register</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TIL</name>
							<description>TIL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TFIS</name>
							<description>TFIS</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TFCS</name>
							<description>TFCS</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RST</name>
					<description>SC RX FIFO Status Register</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RLVL</name>
							<description>RLVL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ROR</name>
							<description>ROR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TST</name>
					<description>SC TX FIFO Status Register</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000080</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TLVL</name>
							<description>TLVL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TUR</name>
							<description>TUR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FCNF</name>
					<description>SC FIFO Configuration Register</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CNFG</name>
							<description>CNFG</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RXTXCNT</name>
							<description>RXTXCNT</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RFIE</name>
							<description>RFIE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TFIE</name>
							<description>TFIE</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RFST</name>
							<description>RFST</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESERVED</name>
							<description>RESERVED</description>
							<bitOffset>5</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
