itzandroidtab/klib-svd/tmpm373.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="SC0">
			<name>SC1</name>
			<baseAddress>0x400200C0</baseAddress>
		</peripheral>
		<peripheral derivedFrom="SC0">
			<name>SC3</name>
			<baseAddress>0x40020140</baseAddress>
		</peripheral>
		<peripheral>
			<name>AD</name>
			<description>Analog-to-Digital Converter (AD)</description>
			<baseAddress>0x40030200</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x50</size>
				<usage>registers</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x50</offset>
				<size>0x18</size>
				<usage>reserved</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x68</offset>
				<size>0x6c</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CLK</name>
					<description>AD Conversion Clock Setting Register</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000048</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADCLK</name>
							<description>ADCLK</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TSH</name>
							<description>TSH</description>
							<bitOffset>3</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MOD0</name>
					<description>AD Mode Setting Register 0</description>
					<addressOffset>0x4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADSS</name>
							<description>ADSS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DACON</name>
							<description>DACON</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MOD1</name>
					<description>AD Mode Setting Register 1</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADAS</name>
							<description>ADAS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ADEN</name>
							<description>ADEN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MOD2</name>
					<description>AD Mode Setting Register 2</description>
					<addressOffset>0xC</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADBFN</name>
							<description>ADBFN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADSFN</name>
							<description>ADSFN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMPCR0</name>
					<description>AD Monitoring Setting Register 0</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REGS0</name>
							<description>REGS0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ADBIG0</name>
							<description>ADBIG0</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP0EN</name>
							<description>CMP0EN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CMPCNT0</name>
							<description>CMPCNT0</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMPCR1</name>
					<description>AD Monitoring Setting Register 1</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REGS1</name>
							<description>REGS1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ADBIG1</name>
							<description>ADBIG1</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP1EN</name>
							<description>CMP1EN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CMPCNT1</name>
							<description>CMPCNT1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMP0</name>
					<description>AD Conversion Result Compare Register 0</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AD0CMP0</name>
							<description>AD0CMP0</description>
							<bitOffset>4</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMP1</name>
					<description>AD Conversion Result Compare Register 1</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AD0CMP1</name>
							<description>AD0CMP1</description>
							<bitOffset>4</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>REG0</name>
					<description>AD Conversion Result Register 0</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADR0RF</name>
							<description>ADR0RF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OVR0</name>
							<description>OVR0</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADR00</name>
							<description>ADR00</description>
							<bitOffset>4</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>REG1</name>
					<description>AD Conversion Result Register 1</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADR1RF</name>
							<description>ADR1RF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OVR1</name>
							<description>OVR1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADR10</name>
							<description>ADR10</description>
							<bitOffset>4</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>REG2</name>
					<description>AD Conversion Result Register 2</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADR2RF</name>
							<description>ADR2RF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OVR2</name>
							<description>OVR2</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADR20</name>
							<description>ADR20</description>
							<bitOffset>4</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>REG3</name>
					<description>AD Conversion Result Register 3</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADR3RF</name>
							<description>ADR3RF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OVR3</name>
							<description>OVR3</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADR30</name>
							<description>ADR30</description>
							<bitOffset>4</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>REG4</name>
					<description>AD Conversion Result Register 4</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADR4RF</name>
							<description>ADR4RF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OVR4</name>
							<description>OVR4</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADR40</name>
							<description>ADR40</description>
							<bitOffset>4</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>REG5</name>
					<description>AD Conversion Result Register 5</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADR5RF</name>
							<description>ADR5RF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OVR5</name>
							<description>OVR5</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADR50</name>
							<description>ADR50</description>
							<bitOffset>4</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>REG6</name>
					<description>AD Conversion Result Register 6</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADR6RF</name>
							<description>ADR6RF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OVR6</name>
							<description>OVR6</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADR60</name>
							<description>ADR60</description>
							<bitOffset>4</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>REG7</name>
					<description>AD Conversion Result Register 7</description>
					<addressOffset>0x3C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADR7RF</name>
							<description>ADR7RF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OVR7</name>
							<description>OVR7</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADR70</name>
							<description>ADR70</description>
							<bitOffset>4</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>REG8</name>
					<description>AD Conversion Result Register 8</description>
					<addressOffset>0x40</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADR8RF</name>
							<description>ADR8RF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OVR8</name>
							<description>OVR8</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADR80</name>
							<description>ADR80</description>
							<bitOffset>4</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>REG9</name>
					<description>AD Conversion Result Register 9</description>
					<addressOffset>0x44</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADR9RF</name>
							<description>ADR9RF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OVR9</name>
							<description>OVR9</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADR90</name>
							<description>ADR90</description>
							<bitOffset>4</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>REG10</name>
					<description>AD Conversion Result Register 10</description>
					<addressOffset>0x48</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADR10RF</name>
							<description>ADR10RF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OVR10</name>
							<description>OVR10</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADR100</name>
							<description>ADR100</description>
							<bitOffset>4</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>REG11</name>
					<description>AD Conversion Result Register 11</description>
					<addressOffset>0x4C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADR11RF</name>
							<description>ADR11RF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OVR11</name>
							<description>OVR11</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADR110</name>
							<description>ADR110</description>
							<bitOffset>4</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PSEL6</name>
					<description>PMD Trigger ProgramNumber Select Register 6</description>
					<addressOffset>0x68</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PMDS6</name>
							<description>PMDS6</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PENS6</name>
							<description>PENS6</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PSEL7</name>
					<description>PMD Trigger ProgramNumber Select Register 7</description>
					<addressOffset>0x6C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PMDS7</name>
							<description>PMDS7</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PENS7</name>
							<description>PENS7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PSEL8</name>
					<description>PMD Trigger ProgramNumber Select Register 8</description>
					<addressOffset>0x70</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PMDS8</name>
							<description>PMDS8</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PENS8</name>
							<description>PENS8</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PSEL9</name>
					<description>PMD Trigger ProgramNumber Select Register 9</description>
					<addressOffset>0x74</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PMDS9</name>
							<description>PMDS9</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PENS9</name>
							<description>PENS9</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PSEL10</name>
					<description>PMD Trigger ProgramNumber Select Register 10</description>
					<addressOffset>0x78</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PMDS10</name>
							<description>PMDS10</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PENS10</name>
							<description>PENS10</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PSEL11</name>
					<description>PMD Trigger ProgramNumber Select Register 11</description>
					<addressOffset>0x7C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PMDS11</name>
							<description>PMDS11</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PENS11</name>
							<description>PENS11</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PINTS0</name>
					<description>PMD Trigger Interrupt Select Register 0</description>
					<addressOffset>0x80</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>INTSEL0</name>
							<description>INTSEL0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PINTS1</name>
					<description>PMD Trigger Interrupt Select Register 1</description>
					<addressOffset>0x84</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>INTSEL1</name>
							<description>INTSEL1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PINTS2</name>
					<description>PMD Trigger Interrupt Select Register 2</description>
					<addressOffset>0x88</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>INTSEL2</name>
							<description>INTSEL2</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PINTS3</name>
					<description>PMD Trigger Interrupt Select Register 3</description>
					<addressOffset>0x8C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>INTSEL3</name>
							<description>INTSEL3</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
