itzandroidtab/klib-svd/tmpm373.svd
				<register>
					<name>PINTS4</name>
					<description>PMD Trigger Interrupt Select Register 4</description>
					<addressOffset>0x90</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>INTSEL4</name>
							<description>INTSEL4</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PINTS5</name>
					<description>PMD Trigger Interrupt Select Register 5</description>
					<addressOffset>0x94</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>INTSEL5</name>
							<description>INTSEL5</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PSET0</name>
					<description>PMD Trigger Program Register 0</description>
					<addressOffset>0x98</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AINSP00</name>
							<description>AINSP00</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVWIS00</name>
							<description>UVWIS00</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSP00</name>
							<description>ENSP00</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSP01</name>
							<description>AINSP01</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVWIS01</name>
							<description>UVWIS01</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSP01</name>
							<description>ENSP01</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSP02</name>
							<description>AINSP02</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVWIS02</name>
							<description>UVWIS02</description>
							<bitOffset>21</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSP02</name>
							<description>ENSP02</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSP03</name>
							<description>AINSP03</description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVWIS03</name>
							<description>UVWIS03</description>
							<bitOffset>29</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSP03</name>
							<description>ENSP03</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PSET1</name>
					<description>PMD Trigger Program Register 1</description>
					<addressOffset>0x9C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AINSP10</name>
							<description>AINSP10</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVWIS10</name>
							<description>UVWIS10</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSP10</name>
							<description>ENSP10</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSP11</name>
							<description>AINSP11</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVWIS11</name>
							<description>UVWIS11</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSP11</name>
							<description>ENSP11</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSP12</name>
							<description>AINSP12</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVWIS12</name>
							<description>UVWIS12</description>
							<bitOffset>21</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSP12</name>
							<description>ENSP12</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSP13</name>
							<description>AINSP13</description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVWIS13</name>
							<description>UVWIS13</description>
							<bitOffset>29</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSP13</name>
							<description>ENSP13</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PSET2</name>
					<description>PMD Trigger Program Register 2</description>
					<addressOffset>0xA0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AINSP20</name>
							<description>AINSP20</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVWIS20</name>
							<description>UVWIS20</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSP20</name>
							<description>ENSP20</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSP21</name>
							<description>AINSP21</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVWIS21</name>
							<description>UVWIS21</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSP21</name>
							<description>ENSP21</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSP22</name>
							<description>AINSP22</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVWIS22</name>
							<description>UVWIS22</description>
							<bitOffset>21</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSP22</name>
							<description>ENSP22</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSP23</name>
							<description>AINSP23</description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVWIS23</name>
							<description>UVWIS23</description>
							<bitOffset>29</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSP23</name>
							<description>ENSP23</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PSET3</name>
					<description>PMD Trigger Program Register 3</description>
					<addressOffset>0xA4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AINSP30</name>
							<description>AINSP30</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVWIS30</name>
							<description>UVWIS30</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSP30</name>
							<description>ENSP30</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSP31</name>
							<description>AINSP31</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVWIS31</name>
							<description>UVWIS31</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSP31</name>
							<description>ENSP31</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSP32</name>
							<description>AINSP32</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVWIS32</name>
							<description>UVWIS32</description>
							<bitOffset>21</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSP32</name>
							<description>ENSP32</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSP33</name>
							<description>AINSP33</description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVWIS33</name>
							<description>UVWIS33</description>
							<bitOffset>29</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSP33</name>
							<description>ENSP33</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PSET4</name>
					<description>PMD Trigger Program Register 4</description>
					<addressOffset>0xA8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AINSP40</name>
							<description>AINSP40</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVWIS40</name>
							<description>UVWIS40</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSP40</name>
							<description>ENSP40</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSP41</name>
							<description>AINSP41</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVWIS41</name>
							<description>UVWIS41</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSP41</name>
							<description>ENSP41</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSP42</name>
							<description>AINSP42</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVWIS42</name>
							<description>UVWIS42</description>
							<bitOffset>21</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSP42</name>
							<description>ENSP42</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSP43</name>
							<description>AINSP43</description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVWIS43</name>
							<description>UVWIS43</description>
							<bitOffset>29</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSP43</name>
							<description>ENSP43</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PSET5</name>
					<description>PMD Trigger Program Register 5</description>
					<addressOffset>0xAC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AINSP50</name>
							<description>AINSP50</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVWIS50</name>
							<description>UVWIS50</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSP50</name>
							<description>ENSP50</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSP51</name>
							<description>AINSP51</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVWIS51</name>
							<description>UVWIS51</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSP51</name>
							<description>ENSP51</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSP52</name>
							<description>AINSP52</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVWIS52</name>
							<description>UVWIS52</description>
							<bitOffset>21</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSP52</name>
							<description>ENSP52</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSP53</name>
							<description>AINSP53</description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVWIS53</name>
							<description>UVWIS53</description>
							<bitOffset>29</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSP53</name>
							<description>ENSP53</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSET03</name>
					<description>Timer Trigger Program Register 03</description>
					<addressOffset>0xB0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AINST0</name>
							<description>AINST0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENST0</name>
							<description>ENST0</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINST1</name>
							<description>AINST1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENST1</name>
							<description>ENST1</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINST2</name>
							<description>AINST2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENST2</name>
							<description>ENST2</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINST3</name>
							<description>AINST3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENST3</name>
							<description>ENST3</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSET47</name>
					<description>Timer Trigger Program Register 47</description>
					<addressOffset>0xB4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AINST4</name>
							<description>AINST4</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENST4</name>
							<description>ENST4</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINST5</name>
							<description>AINST5</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENST5</name>
							<description>ENST5</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINST6</name>
							<description>AINST6</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENST6</name>
							<description>ENST6</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINST7</name>
							<description>AINST7</description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENST7</name>
							<description>ENST7</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSET811</name>
					<description>Timer Trigger Program Register 811</description>
					<addressOffset>0xB8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AINST8</name>
							<description>AINST8</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENST8</name>
							<description>ENST8</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINST9</name>
							<description>AINST9</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENST9</name>
							<description>ENST9</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINST10</name>
							<description>AINST10</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENST10</name>
							<description>ENST10</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINST11</name>
							<description>AINST11</description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENST11</name>
							<description>ENST11</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
