itzandroidtab/klib-svd/tmpm373.svd
				<register>
					<name>SSET03</name>
					<description>Software Trigger Program Register 03</description>
					<addressOffset>0xBC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AINSS0</name>
							<description>AINSS0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSS0</name>
							<description>ENSS0</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSS1</name>
							<description>AINSS1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSS1</name>
							<description>ENSS1</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSS2</name>
							<description>AINSS2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSS2</name>
							<description>ENSS2</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSS3</name>
							<description>AINSS3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSS3</name>
							<description>ENSS3</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SSET47</name>
					<description>Software Trigger Program Register 47</description>
					<addressOffset>0xC0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AINSS4</name>
							<description>AINSS4</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSS4</name>
							<description>ENSS4</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSS5</name>
							<description>AINSS5</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSS5</name>
							<description>ENSS5</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSS6</name>
							<description>AINSS6</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSS6</name>
							<description>ENSS6</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSS7</name>
							<description>AINSS7</description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSS7</name>
							<description>ENSS7</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SSET811</name>
					<description>Software Trigger Program Register 811</description>
					<addressOffset>0xC4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AINSS8</name>
							<description>AINSS8</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSS8</name>
							<description>ENSS8</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSS9</name>
							<description>AINSS9</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSS9</name>
							<description>ENSS9</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSS10</name>
							<description>AINSS10</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSS10</name>
							<description>ENSS10</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSS11</name>
							<description>AINSS11</description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSS11</name>
							<description>ENSS11</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ASET03</name>
					<description>Constant Trigger Program Register 03</description>
					<addressOffset>0xC8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AINSA0</name>
							<description>AINSA0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSA0</name>
							<description>ENSA0</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSA1</name>
							<description>AINSA1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSA1</name>
							<description>ENSA1</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSA2</name>
							<description>AINSA2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSA2</name>
							<description>ENSA2</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSA3</name>
							<description>AINSA3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSA3</name>
							<description>ENSA3</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ASET47</name>
					<description>Constant Trigger Program Register 47</description>
					<addressOffset>0xCC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AINSA4</name>
							<description>AINSA4</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSA4</name>
							<description>ENSA4</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSA5</name>
							<description>AINSA5</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSA5</name>
							<description>ENSA5</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSA6</name>
							<description>AINSA6</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSA6</name>
							<description>ENSA6</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSA7</name>
							<description>AINSA7</description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSA7</name>
							<description>ENSA7</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ASET811</name>
					<description>Constant Trigger Program Register 811</description>
					<addressOffset>0xD0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AINSA8</name>
							<description>AINSA8</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSA8</name>
							<description>ENSA8</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSA9</name>
							<description>AINSA9</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSA9</name>
							<description>ENSA9</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSA10</name>
							<description>AINSA10</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSA10</name>
							<description>ENSA10</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AINSA11</name>
							<description>AINSA11</description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSA11</name>
							<description>ENSA11</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
