itzandroidtab/klib-svd/tmpm373.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>WD</name>
			<description>Watchdog Timer (WD)</description>
			<baseAddress>0x40040000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x8</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>MOD</name>
					<description>WD Mode Register</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000082</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RESCR</name>
							<description>RESCR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>I2WDT</name>
							<description>I2WDT</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WDTP</name>
							<description>WDTP</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WDTE</name>
							<description>WDTE</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<description>WD Control Register</description>
					<addressOffset>0x4</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffff00</resetMask>
					<fields></fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>CG</name>
			<description>Clock Generator (CG)</description>
			<baseAddress>0x40040200</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x18</size>
				<usage>registers</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x18</offset>
				<size>0x4</size>
				<usage>reserved</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x1c</offset>
				<size>0x14</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>SYSCR</name>
					<description>System Control Register</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00010000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>GEAR</name>
							<description>GEAR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PRCK</name>
							<description>PRCK</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FPSEL</name>
							<description>FPSEL</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OSCCR</name>
					<description>Oscillation Control Register</description>
					<addressOffset>0x4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x80010000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>WUEON</name>
							<description>WUEON</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>WUEF</name>
							<description>WUEF</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PLLON</name>
							<description>PLLON</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WUPSEL1</name>
							<description>WUPSEL1</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>XEN1</name>
							<description>XEN1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>XEN2</name>
							<description>XEN2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OSCSEL</name>
							<description>OSCSEL</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HOSCON</name>
							<description>HOSCON</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WUPSEL2</name>
							<description>WUPSEL2</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WU0DR</name>
							<description>WU0DR</description>
							<bitOffset>20</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STBYCR</name>
					<description>Standby Control Register</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000103</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>STBY</name>
							<description>STBY</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RXEN</name>
							<description>RXEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRVE</name>
							<description>DRVE</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PLLSEL</name>
					<description>PLL Selection Register</description>
					<addressOffset>0xC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0000a13e</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PLLSEL</name>
							<description>PLLSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CKSEL</name>
					<description>System Clock Selection Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SYSCKFLG</name>
							<description>SYSCKFLG</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SYSCK</name>
							<description>SYSCK</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ICRCG</name>
					<description>CG Interrupt Request Clear Register</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ICRCG</name>
							<description>ICRCG</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RSTFLG</name>
					<description>Reset Flag Register</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xfffffffe</resetMask>
					<fields>
						<field>
							<name>PONRSTF</name>
							<description>PONRSTF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PINRSTF</name>
							<description>PINRSTF</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WDTRSTF</name>
							<description>WDTRSTF</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VLTDRSTF</name>
							<description>VLTDRSTF</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DBGRSTF</name>
							<description>DBGRSTF</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OFDRSTF</name>
							<description>OFDRSTF</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IMCGA</name>
					<description>CG Interrupt Mode Control Register A</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x20202020</resetValue>
					<resetMask>0xfdffffff</resetMask>
					<fields>
						<field>
							<name>INT3EN</name>
							<description>INT3EN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EMST3</name>
							<description>EMST3</description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMCG3</name>
							<description>EMCG3</description>
							<bitOffset>28</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IMCGB</name>
					<description>CG Interrupt Mode Control Register B</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x20202020</resetValue>
					<resetMask>0xfdfdfdfd</resetMask>
					<fields>
						<field>
							<name>INT4EN</name>
							<description>INT4EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EMST4</name>
							<description>EMST4</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMCG4</name>
							<description>EMCG4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INT5EN</name>
							<description>INT5EN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EMST5</name>
							<description>EMST5</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMCG5</name>
							<description>EMCG5</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INT6EN</name>
							<description>INT6EN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EMST6</name>
							<description>EMST6</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMCG6</name>
							<description>EMCG6</description>
							<bitOffset>20</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INT7EN</name>
							<description>INT7EN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EMST7</name>
							<description>EMST7</description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMCG7</name>
							<description>EMCG7</description>
							<bitOffset>28</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IMCGC</name>
					<description>CG Interrupt Mode Control Register C</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x20202020</resetValue>
					<resetMask>0xfffffffd</resetMask>
					<fields>
						<field>
							<name>INT8EN</name>
							<description>INT8EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EMST8</name>
							<description>EMST8</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMCG8</name>
							<description>EMCG8</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IMCGD</name>
					<description>CG Interrupt Mode Control Register D</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x20202020</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>INTCEN</name>
							<description>INTCEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EMSTC</name>
							<description>EMSTC</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMCGC</name>
							<description>EMCGC</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INTDEN</name>
							<description>INTDEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EMSTD</name>
							<description>EMSTD</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMCGD</name>
							<description>EMCGD</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INTEEN</name>
							<description>INTEEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EMSTE</name>
							<description>EMSTE</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMCGE</name>
							<description>EMCGE</description>
							<bitOffset>20</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INTFEN</name>
							<description>INTFEN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EMSTF</name>
							<description>EMSTF</description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMCGF</name>
							<description>EMCGF</description>
							<bitOffset>28</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
