itzandroidtab/klib-svd/tmpm373.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>OFD</name>
			<description>Oscillation Frequency Detector (OFD)</description>
			<baseAddress>0x40040800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x18</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CR1</name>
					<description>OFD Control Register 1</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000006</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>OFDWEN</name>
							<description>OFDWEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CR2</name>
					<description>OFD Control Register 2</description>
					<addressOffset>0x4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>OFDEN</name>
							<description>OFDEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MNPLLOFF</name>
					<description>OFD Lower Detection Frequency Setting Register</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0000001a</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>OFDMNPLLOFF</name>
							<description>OFDMNPLLOFF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MNPLLON</name>
					<description>OFD Lower Detection Frequency Setting Register</description>
					<addressOffset>0xC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x000000d1</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>OFDMNPLLON</name>
							<description>OFDMNPLLON</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MXPLLOFF</name>
					<description>OFD Higher Detection Frequency Setting Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000028</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>OFDMXPLLOFF</name>
							<description>OFDMXPLLOFF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MXPLLON</name>
					<description>OFD Higher Detection Frequency Setting Register</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000139</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>OFDMXPLLON</name>
							<description>OFDMXPLLON</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>VD</name>
			<description>Power-On Reset Circuit (POR)</description>
			<baseAddress>0x40040900</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x4</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CR</name>
					<description>VD Control Register</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VDEN</name>
							<description>VDEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VDLVL0</name>
							<description>VDLVL0</description>
							<bitOffset>1</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>VE</name>
			<description>Vector Engine (VE)</description>
			<baseAddress>0x40050000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x28</size>
				<usage>registers</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x28</offset>
				<size>0x4</size>
				<usage>reserved</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x2c</offset>
				<size>0x18</size>
				<usage>registers</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x44</offset>
				<size>0x98</size>
				<usage>reserved</usage>
			</addressBlock>
			<addressBlock>
				<offset>0xdc</offset>
				<size>0x58</size>
				<usage>registers</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x134</offset>
				<size>0x4</size>
				<usage>reserved</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x138</offset>
				<size>0x3c</size>
				<usage>registers</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x174</offset>
				<size>0x4</size>
				<usage>reserved</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x178</offset>
				<size>0x4</size>
				<usage>registers</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x17c</offset>
				<size>0x20</size>
				<usage>reserved</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x19c</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>EN</name>
					<description>VE enable_disable R_W</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VEEN</name>
							<description>VEEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VEIDLEN</name>
							<description>VEIDLEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CPURUNTRG</name>
					<description>CPU start trigger selection W</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VCPURTB</name>
							<description>VCPURTB</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TASKAPP</name>
					<description>Task selection R_W</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VTASKB</name>
							<description>VTASKB</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ACTSCH</name>
					<description>Operation schedule selection R_W</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VACTB</name>
							<description>VACTB</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>REPTIME</name>
					<description>Schedule repeat count R_W</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VREPB</name>
							<description>VREPB</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRGMODE</name>
					<description>Start trigger mode R_W</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VTRGB</name>
							<description>VTRGB</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRINTEN</name>
					<description>Error interrupt enable_disable R_W</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VERRENB</name>
							<description>VERRENB</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>COMPEND</name>
					<description>VE forced termination W</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VCENDB</name>
							<description>VCENDB</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRDET</name>
					<description>Error detection R</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VERRDB</name>
							<description>VERRDB</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SCHTASKRUN</name>
					<description>Schedule executing flag_executing task R</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VRSCHB</name>
							<description>VRSCHB</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VRTASKB</name>
							<description>VRTASKB</description>
							<bitOffset>6</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TMPREG0</name>
					<description>Temporary register R_W</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TMPREG0</name>
							<description>TMPREG0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TMPREG1</name>
					<description>Temporary register R_W</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TMPREG1</name>
							<description>TMPREG1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TMPREG2</name>
					<description>Temporary register R_W</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TMPREG2</name>
							<description>TMPREG2</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TMPREG3</name>
					<description>Temporary register R_W</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TMPREG3</name>
							<description>TMPREG3</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TMPREG4</name>
					<description>Temporary register R_W</description>
					<addressOffset>0x3C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TMPREG4</name>
							<description>TMPREG4</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TMPREG5</name>
					<description>Temporary register R_W</description>
					<addressOffset>0x40</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TMPREG5</name>
							<description>TMPREG5</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MCTLF1</name>
					<description>Status flags R_W</description>
					<addressOffset>0xDC </addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>LAVF</name>
							<description>LAVF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LAVFM</name>
							<description>LAVFM</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LVTF</name>
							<description>LVTF</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PLSLF</name>
							<description>PLSLF</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PLSLFM</name>
							<description>PLSLFM</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MODE1</name>
					<description>Task control mode R_W</description>
					<addressOffset>0xE0 </addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PVIEN</name>
							<description>PVIEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ZIEN</name>
							<description>ZIEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OCRMD</name>
							<description>OCRMD</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FMODE1</name>
					<description>Flow control R_W</description>
					<addressOffset>0xE4 </addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>C2PEN</name>
							<description>C2PEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SPWMEN</name>
							<description>SPWMEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IDMODE</name>
							<description>IDMODE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MREGDIS</name>
							<description>MREGDIS</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TPWM1</name>
					<description>0PWM period rate (PWM period _s_ * maximum speed*1 * 2^16) R_W</description>
					<addressOffset>0xE8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TPWM</name>
							<description>TPWM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OMEGA1</name>
					<description>Rotation speed (speed _Hz__ maximum speed *1_1 * 2^15) R_W</description>
					<addressOffset>0xEC </addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>OMEGA</name>
							<description>OMEGA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>THETA1</name>
					<description>Motor phase (motor phase _deg__360 * 2^16) R_W</description>
					<addressOffset>0xF0 </addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>THETA</name>
							<description>THETA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IDREF1</name>
					<description>d-axis reference value (current _A_ _ maximum current*2 * 2^15) R_W</description>
					<addressOffset>0xF4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DREF</name>
							<description>DREF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IQREF1</name>
					<description>q-axis reference value (current _A_ _ maximum current *2 * 2^15) R_W</description>
					<addressOffset>0xF8 </addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>QREF</name>
							<description>QREF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VD1</name>
					<description>d-axis voltage (voltage _V_ _ maximum voltage *3 * 2^31) R_W</description>
					<addressOffset>0xFC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VD</name>
							<description>VD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VQ1</name>
					<description>q-axis voltage (voltage _V_ _ maximum voltage *3 * 2^31) R_W</description>
					<addressOffset>0x100</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VQ</name>
							<description>VQ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CIDKI1</name>
					<description>Integral coefficient for PI control of d-axis R_W</description>
					<addressOffset>0x104</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CIDKI</name>
							<description>CIDKI</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CIDKP1</name>
					<description>Proportional coefficient for PI control of d-axis R_W</description>
					<addressOffset>0x108</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CIDKP</name>
							<description>CIDKP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CIQKI1</name>
					<description>Integral coefficient for PI control of q-axis R_W</description>
					<addressOffset>0x10C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CIQKI</name>
							<description>CIQKI</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CIQKP1</name>
					<description>Proportional coefficient for PI control of q-axis R_W</description>
					<addressOffset>0x110</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CIQKP</name>
							<description>CIQKP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
