itzandroidtab/klib-svd/tmpm373.svd
				<register>
					<name>VDIH1</name>
					<description>Upper 32 bits of integral term (VDI ) of d-axis voltage R_W</description>
					<addressOffset>0x114</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VDIH</name>
							<description>VDIH</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VDILH1</name>
					<description>Lower 32 bits of integral term (VDI) of d-axis voltage R_W</description>
					<addressOffset>0x118</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VDILH</name>
							<description>VDILH</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VQIH1</name>
					<description>Upper 32 bits of integral term (VQI) of q-axis voltage R_W</description>
					<addressOffset>0x11C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VQIH</name>
							<description>VQIH</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VQILH1</name>
					<description>Lower 32 bits of integral term (VQI) of q-axis voltage R_W</description>
					<addressOffset>0x120</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VQILH</name>
							<description>VQILH</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPWMCHG1</name>
					<description>Switching speed (for 2-phase modulation and shift PWM) R_W</description>
					<addressOffset>0x124</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FPWMCHG</name>
							<description>FPWMCHG</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MDPRD1</name>
					<description>PWM period (to be set identically with PMD's PWM period) R_W</description>
					<addressOffset>0x128</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VMDPRD</name>
							<description>VMDPRD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MINPLS1</name>
					<description>Minimum pulse width R_W</description>
					<addressOffset>0x12C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MINPLS</name>
							<description>MINPLS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRGCRC1</name>
					<description>Synchronizing trigger correction value R_W</description>
					<addressOffset>0x130</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TRGCRC</name>
							<description>TRGCRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>COS1</name>
					<description>Cosine value at THETA for output conversion (Q15 data) R_W</description>
					<addressOffset>0x138</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>COS</name>
							<description>COS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SIN1</name>
					<description>Sine value at THETA for output conversion (Q15 data) R_W</description>
					<addressOffset>0x13C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SIN</name>
							<description>SIN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>COSM1</name>
					<description>Previous cosine value for input processing (Q15 data) R_W</description>
					<addressOffset>0x140</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>COSM</name>
							<description>COSM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SINM1</name>
					<description>Previous sine value for input processing (Q15 data) R_W</description>
					<addressOffset>0x144</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SINM</name>
							<description>SINM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SECTOR1</name>
					<description>Sector information (0-11) R_W</description>
					<addressOffset>0x148</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SECTOR</name>
							<description>SECTOR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SECTORM1</name>
					<description>Previous sector information for input processing (0-11) R_W</description>
					<addressOffset>0x14C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SECTORM</name>
							<description>SECTORM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IAO1</name>
					<description>AD conversion result of a-phase zero-current *4 R_W</description>
					<addressOffset>0x150</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IAO</name>
							<description>IAO</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IBO1</name>
					<description>AD conversion result of b-phase zero-current *4 R_W</description>
					<addressOffset>0x154</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IB0</name>
							<description>IB0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ICO1</name>
					<description>AD conversion result of c-phase zero-current *4 R_W</description>
					<addressOffset>0x158</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IC0</name>
							<description>IC0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IAADC1</name>
					<description>AD conversion result of a-phase current *4 R_W</description>
					<addressOffset>0x15C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IAADC</name>
							<description>IAADC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IBADC1</name>
					<description>AD conversion result of b-phase current *4 R_W</description>
					<addressOffset>0x160</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IBADC</name>
							<description>IBADC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ICADC1</name>
					<description>AD conversion result of c-phase current *4 R_W</description>
					<addressOffset>0x164</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ICADC</name>
							<description>ICADC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VDC1</name>
					<description>DC supply voltage (voltage _V_ _ maximum voltage *3 * 2^15) R_W</description>
					<addressOffset>0x168</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VDC</name>
							<description>VDC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID1</name>
					<description>d-axis current (current _A_ _ maximum current *2 * 2^31) R_W</description>
					<addressOffset>0x16C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ID</name>
							<description>ID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IQ1</name>
					<description>q-axis current (current _A_ _ maximum current *2 * 2^31) R_W</description>
					<addressOffset>0x170</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IQ</name>
							<description>IQ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TADC</name>
					<description>Common ADC conversion time (based on PWM clock) R_</description>
					<addressOffset>0x178</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TADC</name>
							<description>TADC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VCMPU1</name>
					<description>PMD control_ CMPU setting R_W</description>
					<addressOffset>0x19C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VCMPU</name>
							<description>VCMPU</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VCMPV1</name>
					<description>PMD control_ CMPV setting R_W</description>
					<addressOffset>0x1A0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VCMPV</name>
							<description>VCMPV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VCMPW1</name>
					<description>PMD control_ CMPW setting R_W</description>
					<addressOffset>0x1A4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VCMPW</name>
							<description>VCMPW</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OUTCR1</name>
					<description>PMD control_ Output control (MDOUT) R_W</description>
					<addressOffset>0x1A8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>U0C</name>
							<description>U0C</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VOC</name>
							<description>VOC</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>W0C</name>
							<description>W0C</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UPWM</name>
							<description>UPWM</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VPWM</name>
							<description>VPWM</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WPWM</name>
							<description>WPWM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VTRGCMP01</name>
					<description>PMD control_ TRGCMP0 setting R_W</description>
					<addressOffset>0x1AC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VTRGCMP0</name>
							<description>VTRGCMP0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VTRGCMP11</name>
					<description>PMD control_ TRGCMP1 setting R_W</description>
					<addressOffset>0x1B0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VTRGCMP1</name>
							<description>VTRGCMP1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VTRGSEL1</name>
					<description>PMD control_ Trigger selection R_W</description>
					<addressOffset>0x1B4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VTRGSEL</name>
							<description>VTRGSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EMGRS1</name>
					<description>PMD control_ EMG return (EMGCR_EMGRS_) W</description>
					<addressOffset>0x1B8</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EMGRS</name>
							<description>EMGRS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
