itzandroidtab/klib-svd/tmpm373.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>PMD</name>
			<description>16-bit Multi-Purpose Timer (MPT-PMD)</description>
			<baseAddress>0x40050480</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x64</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>MDEN</name>
					<description>PMD Enable Register</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PWMEN</name>
							<description>PWMEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PORTMD</name>
					<description>Port Output Mode Register</description>
					<addressOffset>0x4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PORTMD</name>
							<description>PORTMD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MDCR</name>
					<description>PMD Control Register</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PWMMD</name>
							<description>PWMMD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INTPRD</name>
							<description>INTPRD</description>
							<bitOffset>1</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PINT</name>
							<description>PINT</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DTYMD</name>
							<description>DTYMD</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNTMD</name>
							<description>SYNTMD</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PWMCK</name>
							<description>PWMCK</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CNTSTA</name>
					<description>PWM Counter Status Register</description>
					<addressOffset>0xC</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>UPDWN</name>
							<description>UPDWN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MDCNT</name>
					<description>PWM Counter Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MDCNT</name>
							<description>MDCNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MDPRD</name>
					<description>PWM Period Register</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MDPRD</name>
							<description>MDPRD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMPU</name>
					<description>PWM Compare Register</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CMPU1</name>
							<description>CMPU1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMPV</name>
					<description>PWM Compare Register</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CMPV1</name>
							<description>CMPV1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMPW</name>
					<description>PWM Compare Register</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CMPW1</name>
							<description>CMPW1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MODESEL</name>
					<description>PWM Mode Select Register</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MDSEL</name>
							<description>MDSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MDOUT</name>
					<description>PMD Output Control Register</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>UOC</name>
							<description>UOC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VOC</name>
							<description>VOC</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WOC</name>
							<description>WOC</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UPWM</name>
							<description>UPWM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VPWM</name>
							<description>VPWM</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WPWM</name>
							<description>WPWM</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MDPOT</name>
					<description>PMD Output Setting Register</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PSYNCS</name>
							<description>PSYNCS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>POLL</name>
							<description>POLL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>POLH</name>
							<description>POLH</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EMGREL</name>
					<description>EMG Release Register</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EMGREL</name>
							<description>EMGREL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EMGCR</name>
					<description>EMG Control Register</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000039</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EMGEN</name>
							<description>EMGEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EMGRS</name>
							<description>EMGRS</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>EMGMD</name>
							<description>EMGMD</description>
							<bitOffset>3</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INHEN</name>
							<description>INHEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>EMGCNT</name>
							<description>EMGCNT</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EMGSTA</name>
					<description>EMG Status Register</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xfffffffd</resetMask>
					<fields>
						<field>
							<name>EMGST</name>
							<description>EMGST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMGI</name>
							<description>EMGI</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OVVCR</name>
					<description>OVV Control Register</description>
					<addressOffset>0x3C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>OVVEN</name>
							<description>OVVEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OVVRS</name>
							<description>OVVRS</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OVVISEL</name>
							<description>OVVISEL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OVVMD</name>
							<description>OVVMD</description>
							<bitOffset>3</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ADIN0EN</name>
							<description>ADIN0EN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ADIN1EN</name>
							<description>ADIN1EN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OVVCNT</name>
							<description>OVVCNT</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OVVSTA</name>
					<description>OVV Status Register</description>
					<addressOffset>0x40</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xfffffffd</resetMask>
					<fields>
						<field>
							<name>OVVST</name>
							<description>OVVST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OVVISEL</name>
							<description>OVVISEL</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DTR</name>
					<description>Dead Time Register</description>
					<addressOffset>0x44</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DTR</name>
							<description>DTR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRGCMP0</name>
					<description>Trigger Compare Register 0</description>
					<addressOffset>0x48</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TRGCMP0</name>
							<description>TRGCMP0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRGCMP1</name>
					<description>Trigger Compare Register 1</description>
					<addressOffset>0x4C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TRGCMP1</name>
							<description>TRGCMP1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRGCMP2</name>
					<description>Trigger Compare Register 2</description>
					<addressOffset>0x50</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TRGCMP2</name>
							<description>TRGCMP2</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRGCMP3</name>
					<description>Trigger Compare Register 3</description>
					<addressOffset>0x54</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TRGCMP3</name>
							<description>TRGCMP3</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRGCR</name>
					<description>Trigger Control Register</description>
					<addressOffset>0x58</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TRG0MD</name>
							<description>TRG0MD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRG0BE</name>
							<description>TRG0BE</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRG1MD</name>
							<description>TRG1MD</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRG1BE</name>
							<description>TRG1BE</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRG2MD</name>
							<description>TRG2MD</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRG2BE</name>
							<description>TRG2BE</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRG3MD</name>
							<description>TRG3MD</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRG3BE</name>
							<description>TRG3BE</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRGMD</name>
					<description>Trigger Output Mode Setting Register</description>
					<addressOffset>0x5C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EMGTGE</name>
							<description>EMGTGE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRGOUT</name>
							<description>TRGOUT</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRGSEL</name>
					<description>Trigger Output Select Register</description>
					<addressOffset>0x60</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TRGSEL</name>
							<description>TRGSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
