itzandroidtab/klib-svd/tmpm373.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>FC</name>
			<description>Flash Control (FC)</description>
			<baseAddress>0x41FFF010</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x4</size>
				<usage>registers</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x4</offset>
				<size>0xc</size>
				<usage>reserved</usage>
			</addressBlock>
			<addressBlock>
				<offset>0x10</offset>
				<size>0x4</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>SECBIT</name>
					<description>FC Security Bit Register</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SECBIT</name>
							<description>SECBIT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FLCS</name>
					<description>FC Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xfff0ffff</resetMask>
					<fields>
						<field>
							<name>RDY_BSY</name>
							<description>RDY_BSY</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BLPRO0</name>
							<description>BLPRO0</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BLPRO1</name>
							<description>BLPRO1</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BLPRO2</name>
							<description>BLPRO2</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BLPRO3</name>
							<description>BLPRO3</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
	</peripherals>
</device>
